In [2]:
import pandas as pd

!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (1.3.10)

In [3]:
import pymysql
from sqlalchemy import create_engine

In [4]:
engine = create_engine('sqlite:////Users/Stefania/downloads/stefaniabraca.db')

# dfpersonal_info

In [5]:
query = "select * from personal_info"
dfpersonal_info = pd.read_sql_query(query, engine)
dfpersonal_info.head(15)

,id,lastName,age,Unnamed: 0,gender,country,image
0,5227,bEZOS,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,2642,GATES,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,5422,bufFETT,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8183,aRNAULt,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...
4,5642,zuckeRBERG,1985,56,M,USA,https://specials-images.forbesimg.com/imageser...
5,1690,ortEGa,82 years old,57,M,None,https://specials-images.forbesimg.com/imageser...
6,2877,sLIM Helu,78 years old,58,None,Mexico,https://specials-images.forbesimg.com/imageser...
7,1939,koCH,82 years old,59,M,United States,https://specials-images.forbesimg.com/imageser...
8,9011,kOCH,78 years old,60,Male,USA,https://specials-images.forbesimg.com/imageser...
9,7523,elLISOn,73 years old,61,M,None,https://specials-images.forbesimg.com/imageser...
10,8133,blOOMBERG,76 years old,62,Male,None,https://specials-images.forbesimg.com/imageser...
11,8447,pAGE,45 years old,63,None,None,https://specials-images.forbesimg.com/imageser...
12,5897,BRIN,44 years old,64,M,United States,https://specials-images.forbesimg.com/imageser...
13,4296,walTON,70 years old,65,Male,United States,https://specials-images.forbesimg.com/imageser...
14,2162,waLTON,73 years old,66,M,None,https://specials-images.forbesimg.com/imageser...

In [6]:
dfpersonal_info.columns

Index(['id', 'lastName', 'age', 'Unnamed: 0', 'gender', 'country', 'image'], dtype='object')

In [7]:
dfpersonal_info_column_names = dfpersonal_info.columns

In [8]:
for i in dfpersonal_info_column_names:
  print('{} is unique: {}'.format(i, dfpersonal_info[i].is_unique))

id is unique: True
lastName is unique: False
age is unique: False
Unnamed: 0 is unique: True
gender is unique: False
country is unique: False
image is unique: False

In [9]:
dfpersonal_info.dtypes

id             int64
lastName      object
age           object
Unnamed: 0     int64
gender        object
country       object
image         object
dtype: object

In [10]:
dfpersonal_info.index.values

array([   0,    1,    2, ..., 2205, 2206, 2207])

# dfbusiness_info

In [11]:
query = "select * from business_info"
dfbusiness_info = pd.read_sql_query(query, engine)
dfbusiness_info.head(15)

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,5227,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,2642,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,5422,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,8183,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,5642,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5
5,1690,57,Fashion & Retail ==> Zara,70.0 BUSD,0.0 millions USD,None,6
6,2877,58,Telecom ==> telecom,67.1 BUSD,0.001 millions USD,None,7
7,1939,59,Diversified ==> Koch Industries,60.0 BUSD,0.0 millions USD,None,12
8,9011,60,Diversified ==> Koch Industries,60.0 BUSD,0.0 millions USD,None,13
9,7523,61,Technology ==> software,58.5 BUSD,-0.001 millions USD,None,8
10,8133,62,Media & Entertainment ==> Bloomberg LP,50.0 BUSD,0.0 millions USD,None,11
11,8447,63,Technology ==> Google,48.8 BUSD,0.0 millions USD,None,9
12,5897,64,Technology ==> Google,47.5 BUSD,0.0 millions USD,None,10
13,4296,65,Fashion & Retail ==> Walmart,46.4 BUSD,0.0 millions USD,None,19
14,2162,66,Fashion & Retail ==> Walmart,46.2 BUSD,0.0 millions USD,None,20

In [12]:
dfbusiness_info_column_names = dfbusiness_info.columns
print(dfbusiness_info_column_names)

Index(['id', 'Unnamed: 0', 'Source', 'worth', 'worthChange', 'realTimeWorth',
       'realTimePosition'],
      dtype='object')

In [13]:
dfbusiness_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 7 columns):
id                  2208 non-null int64
Unnamed: 0          2208 non-null int64
Source              2208 non-null object
worth               2208 non-null object
worthChange         2208 non-null object
realTimeWorth       0 non-null object
realTimePosition    2208 non-null int64
dtypes: int64(3), object(4)
memory usage: 120.9+ KB

In [14]:
dfbusiness_info.isnull()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,False,False,False,False,False,True,False
1,False,False,False,False,False,True,False
2,False,False,False,False,False,True,False
3,False,False,False,False,False,True,False
4,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...
2203,False,False,False,False,False,True,False
2204,False,False,False,False,False,True,False
2205,False,False,False,False,False,True,False
2206,False,False,False,False,False,True,False
2207,False,False,False,False,False,True,False

In [15]:
dfbusiness_info.isnull().sum()

id                     0
Unnamed: 0             0
Source                 0
worth                  0
worthChange            0
realTimeWorth       2208
realTimePosition       0
dtype: int64

In [16]:
dfbusiness_info.isnull().sum() > 0

id                  False
Unnamed: 0          False
Source              False
worth               False
worthChange         False
realTimeWorth        True
realTimePosition    False
dtype: bool

In [17]:
 dfbusiness_info.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,5227,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,2642,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,5422,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,8183,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,5642,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5

In [18]:
dfbusiness_info.drop('realTimeWorth', axis=1, inplace=True)

In [38]:
dfbusiness_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 6 columns):
id                  2208 non-null int64
Unnamed: 0          2208 non-null int64
Source              2208 non-null object
worth               2208 non-null object
worthChange         2208 non-null object
realTimePosition    2208 non-null int64
dtypes: int64(3), object(3)
memory usage: 103.6+ KB

In [20]:
dfbusiness_info_column_names = dfbusiness_info.columns

In [21]:
for i in dfbusiness_info_column_names:
  print('{} is unique: {}'.format(i, dfbusiness_info[i].is_unique))

id is unique: True
Unnamed: 0 is unique: True
Source is unique: False
worth is unique: False
worthChange is unique: False
realTimePosition is unique: False

In [22]:
dfbusiness_info.dtypes

id                   int64
Unnamed: 0           int64
Source              object
worth               object
worthChange         object
realTimePosition     int64
dtype: object

In [23]:
dfbusiness_info.index.values

array([   0,    1,    2, ..., 2205, 2206, 2207])

# dfrank_info

In [24]:
query = "select * from rank_info"
dfrank_info = pd.read_sql_query(query, engine)
dfrank_info.head()

     id                         name  position  Unnamed: 0
0  1431  anANT ASAVABHOKHIN & FAmily       NaN           0
1  7293               arASH FERDowsi       NaN           1
2  3534     banthoON LAMSAM & FAMILy       NaN           2
3  2538       bill ADDERLEY & family       NaN           3
4  2722            borIS ZINGArevich       NaN           4

In [25]:
dfrank_info.columns

Index(['id', 'name', 'position', 'Unnamed: 0'], dtype='object')

In [26]:
dfrank_info_column_names = dfrank_info.columns

In [27]:
for i in dfrank_info_column_names:
  print('{} is unique: {}'.format(i, dfrank_info[i].is_unique))

id is unique: True
name is unique: True
position is unique: False
Unnamed: 0 is unique: True

In [28]:
dfrank_info.dtypes

id              int64
name           object
position      float64
Unnamed: 0      int64
dtype: object

In [29]:
dfrank_info.index.values

array([   0,    1,    2, ..., 2257, 2258, 2259])

# Merge

In [41]:
merged_df = dfrank_info.merge(dfbusiness_info, on='id')

In [42]:
merged_df.index.values

array([   0,    1,    2, ..., 2205, 2206, 2207])

In [43]:
final_df = merged_df.merge(dfpersonal_info, on='id')

In [44]:
final_df.head()

,id,name,position,Unnamed: 0_x,Unnamed: 0_y,Source,worth,worthChange,realTimePosition,lastName,age,Unnamed: 0,gender,country,image
0,5227,jeff BEZos,1.0,52,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,1,bEZOS,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,2642,bill GATES,2.0,53,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,2,GATES,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,5422,warrEN BUFFEtt,3.0,54,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,3,bufFETT,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8183,bernarD ARNAULT,4.0,55,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,4,aRNAULt,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...
4,5642,mark zUCKERBerg,5.0,56,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,5,zuckeRBERG,1985,56,M,USA,https://specials-images.forbesimg.com/imageser...

In [45]:
#drop duplicated columns

final_df.drop('Unnamed: 0_x', axis=1, inplace=True) 
final_df.drop('Unnamed: 0_y', axis=1, inplace=True)

In [46]:
final_df.head()

,id,name,position,Source,worth,worthChange,realTimePosition,lastName,age,Unnamed: 0,gender,country,image
0,5227,jeff BEZos,1.0,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,1,bEZOS,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,2642,bill GATES,2.0,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,2,GATES,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,5422,warrEN BUFFEtt,3.0,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,3,bufFETT,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8183,bernarD ARNAULT,4.0,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,4,aRNAULt,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...
4,5642,mark zUCKERBerg,5.0,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,5,zuckeRBERG,1985,56,M,USA,https://specials-images.forbesimg.com/imageser...

In [47]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2208 entries, 0 to 2207
Data columns (total 13 columns):
id                  2208 non-null int64
name                2208 non-null object
position            2208 non-null float64
Source              2208 non-null object
worth               2208 non-null object
worthChange         2208 non-null object
realTimePosition    2208 non-null int64
lastName            2208 non-null object
age                 2143 non-null object
Unnamed: 0          2208 non-null int64
gender              2195 non-null object
country             2208 non-null object
image               2208 non-null object
dtypes: float64(1), int64(3), object(9)
memory usage: 241.5+ KB

In [48]:
final_df.index.values

array([   0,    1,    2, ..., 2205, 2206, 2207])